In [5]:
import pandas as pd

In [7]:
gpt3 = pd.read_csv("gpt3.csv")
gpt3

,ID,Name,Department,Experience,Education,Salary,PerformanceScore,ProjectsCompleted,Remote,WorkingHours,Bonus,Age
0,1,Employee_1,Marketing,15,PhD,6658.0,3.46,7,True,30,736.0,28
1,2,Employee_2,Sales,29,Master,9470.0,4.65,19,False,49,7946.0,55
2,3,Employee_3,Finance,24,Bachelor,9438.0,1.56,28,False,57,4943.0,41
3,4,Employee_4,Sales,2,Bachelor,16272.0,1.40,21,True,66,7270.0,45
4,5,Employee_5,Sales,24,High School,12844.0,2.02,20,True,66,6599.0,31
...,...,...,...,...,...,...,...,...,...,...,...,...
295,296,Employee_296,Marketing,9,High School,13897.0,3.40,11,True,37,4467.0,30
296,297,Employee_297,Operations,10,Bachelor,15499.0,4.61,20,False,49,6945.0,21
297,298,Employee_298,Marketing,11,PhD,3314.0,4.96,23,False,32,9614.0,28
298,299,Employee_299,Operations,28,Master,19229.0,3.97,27,True,45,2659.0,40
299,300,Employee_300,Finance,12,High School,13041.0,1.26,25,False,59,5632.0,43

In [9]:
gpt3.loc[gpt3["Salary"]>=gpt3["Salary"].quantile(0.95),["ID","Department","Salary"]]

      ID  Department    Salary
23    24          HR   19600.0
34    35  Operations   19654.0
37    38     Finance   19961.0
73    74   Marketing   19644.0
85    86   Marketing   19555.0
94    95   Marketing   19407.0
115  116          HR   19248.0
122  123  Operations   19802.0
161  162          HR   19760.0
172  173  Operations   19947.0
238  239          HR   19484.0
240  241  Operations   19949.0
268  269  Operations   19834.0
270  271     Finance  100000.0
298  299  Operations   19229.0

In [10]:
gpt3.groupby("Department",as_index=False).agg({
    "Bonus":"mean",
    "PerformanceScore":"mean"
})

   Department        Bonus  PerformanceScore
0     Finance  6235.380000          2.860192
1          HR  5171.487179          3.002857
2          IT  5900.303571          3.102456
3   Marketing  5590.158730          3.018906
4  Operations  5325.800000          3.305435
5       Sales  6260.675676          3.043846

In [11]:
gpt3["Age"].corr(gpt3["Experience"])

np.float64(0.03895961453183421)

In [12]:
gpt3[(gpt3["ProjectsCompleted"]>10) & (gpt3["Remote"]==False)][["Salary","Bonus"]].mean()

Salary    10952.313131
Bonus      5900.959596
dtype: float64

In [13]:
pd.pivot_table(gpt3,index="Department",columns="Education",values=["PerformanceScore","Bonus"],aggfunc="mean")

                  Bonus                                         \
Education      Bachelor  High School       Master          PhD
Department
Finance     5326.687500  5733.000000  9149.888889  5805.333333
HR          5448.166667  3631.666667  6986.000000  5738.888889
IT          6221.222222  6021.117647  5936.941176  5472.230769
Marketing   4560.071429  6444.631579  5547.000000  5518.166667
Operations  5364.214286  4422.454545  5345.222222  6164.363636
Sales       7302.500000  6311.812500  5787.600000  5793.000000

           PerformanceScore
Education          Bachelor High School    Master       PhD
Department
Finance            2.896111    2.673846  2.474444  3.297500
HR                 1.981667    3.378750  3.442222  2.653636
IT                 2.930000    3.165294  3.063529  3.184286
Marketing          2.885714    2.999500  2.758333  3.317778
Operations         3.413571    3.412727  3.210000  3.152500
Sales              2.638333    3.234375  2.861000  3.217143

In [14]:
gpt3[["Salary","Bonus"]].isna().sum()

Salary    10
Bonus     10
dtype: int64

In [15]:
q01, q99 = gpt3["Salary"].quantile([0.01, 0.99])
gpt3[(gpt3["Salary"] > q01) & (gpt3["Salary"] < q99)]["Salary"]

0       6658.0
1       9470.0
2       9438.0
3      16272.0
4      12844.0
        ...
295    13897.0
296    15499.0
297     3314.0
298    19229.0
299    13041.0
Name: Salary, Length: 284, dtype: float64

In [16]:
gpt3[gpt3["Remote"]==False].groupby("Department",as_index=False)["Salary"].mean()

   Department        Salary
0     Finance   9820.785714
1          HR  11598.391304
2          IT  10952.000000
3   Marketing  11032.000000
4  Operations  11971.615385
5       Sales   9970.210526

In [17]:
pd.pivot_table(gpt3,values=["PerformanceScore","Bonus"],aggfunc="mean",index="Education")

                   Bonus  PerformanceScore
Education
Bachelor     5487.107692          2.901642
High School  5532.384615          3.138817
Master       6343.909091          2.968636
PhD          5714.014706          3.154189

In [18]:
gpt3[(gpt3["ProjectsCompleted"]>10) & (gpt3["PerformanceScore"]>=4)][["Age","WorkingHours"]].mean()

Age             39.596154
WorkingHours    50.057692
dtype: float64

In [19]:
gpt3[["Salary","Bonus"]].fillna(gpt3[["Salary","Bonus"]].mean())

      Salary   Bonus
0     6658.0   736.0
1     9470.0  7946.0
2     9438.0  4943.0
3    16272.0  7270.0
4    12844.0  6599.0
..       ...     ...
295  13897.0  4467.0
296  15499.0  6945.0
297   3314.0  9614.0
298  19229.0  2659.0
299  13041.0  5632.0

[300 rows x 2 columns]

In [20]:
q01=gpt3["Salary"].quantile(0.01)
q99=gpt3["Salary"].quantile(0.99)
gpt3.loc[gpt3["Salary"]<q01,"Salary"]=gpt3["Salary"].median()
gpt3.loc[gpt3["Salary"]>q99,"Salary"]=gpt3["Salary"].median()

In [21]:
pd.pivot_table(gpt3,values=["PerformanceScore","Bonus"],aggfunc="mean",index="Department")

                  Bonus  PerformanceScore
Department
Finance     6235.380000          2.860192
HR          5171.487179          3.002857
IT          5900.303571          3.102456
Marketing   5590.158730          3.018906
Operations  5325.800000          3.305435
Sales       6260.675676          3.043846

In [22]:
gpt3[(gpt3["ProjectsCompleted"]>=15) & (gpt3["PerformanceScore"]>=4)][["Age","WorkingHours"]].mean()

Age             39.195122
WorkingHours    50.390244
dtype: float64

In [23]:
gpt3[(gpt3["Experience"]<5) & (gpt3["Salary"]>=10000)][["ID","Department","Salary","Experience"]]

      ID  Department   Salary  Experience
3      4       Sales  16272.0           2
9     10       Sales  10675.0           1
11    12     Finance  15263.0           2
16    17  Operations  13416.0           0
18    19          HR  15956.0           0
26    27   Marketing  15275.0           2
46    47          HR  14673.0           1
49    50   Marketing  15551.0           0
52    53          HR  12021.0           0
53    54          IT  10517.0           4
59    60   Marketing  12820.0           2
78    79   Marketing  14137.0           2
80    81          HR  12411.0           0
85    86   Marketing  19555.0           0
86    87          IT  12661.0           2
100  101       Sales  12953.0           1
126  127  Operations  10173.0           3
160  161          HR  13054.0           4
161  162          HR  19760.0           0
167  168   Marketing  14113.0           4
169  170   Marketing  16418.0           3
175  176          HR  11611.0           2
193  194       Sales  19108.0           4
201  202   Marketing  12265.0           0
206  207   Marketing  15477.0           1
214  215          IT  11012.0           0
233  234     Finance  10507.0           4
240  241  Operations  11063.0           4
249  250   Marketing  11684.0           0
252  253   Marketing  13746.0           4
258  259   Marketing  10889.0           3
259  260          IT  17874.0           1
265  266          IT  13289.0           0
267  268          HR  13760.0           4
274  275   Marketing  13604.0           1
284  285          IT  18978.0           0
291  292          IT  14798.0           2
292  293   Marketing  16653.0           0
293  294     Finance  13611.0           0

In [24]:
gpt3.fillna({
    "Salary": gpt3["Salary"].median(),
    "Bonus": gpt3["Bonus"].mean()
})

,ID,Name,Department,Experience,Education,Salary,PerformanceScore,ProjectsCompleted,Remote,WorkingHours,Bonus,Age
0,1,Employee_1,Marketing,15,PhD,6658.0,3.46,7,True,30,736.0,28
1,2,Employee_2,Sales,29,Master,9470.0,4.65,19,False,49,7946.0,55
2,3,Employee_3,Finance,24,Bachelor,9438.0,1.56,28,False,57,4943.0,41
3,4,Employee_4,Sales,2,Bachelor,16272.0,1.40,21,True,66,7270.0,45
4,5,Employee_5,Sales,24,High School,12844.0,2.02,20,True,66,6599.0,31
...,...,...,...,...,...,...,...,...,...,...,...,...
295,296,Employee_296,Marketing,9,High School,13897.0,3.40,11,True,37,4467.0,30
296,297,Employee_297,Operations,10,Bachelor,15499.0,4.61,20,False,49,6945.0,21
297,298,Employee_298,Marketing,11,PhD,3314.0,4.96,23,False,32,9614.0,28
298,299,Employee_299,Operations,28,Master,19229.0,3.97,27,True,45,2659.0,40
299,300,Employee_300,Finance,12,High School,13041.0,1.26,25,False,59,5632.0,43

In [25]:
gpt3["Normalize"]=(gpt3["PerformanceScore"]-gpt3["PerformanceScore"].min()) / (gpt3["PerformanceScore"].min()-gpt3["PerformanceScore"].max())
pd.pivot_table(gpt3,index="Department",columns="Remote",values="Normalize",aggfunc="mean")

Remote         False     True
Department
Finance    -0.427857 -0.508437
HR         -0.504674 -0.495921
IT         -0.490515 -0.577500
Marketing  -0.524922 -0.484531
Operations -0.600093 -0.542632
Sales      -0.516625 -0.505000

In [26]:
Q1 = gpt3["Salary"].quantile(0.25)
Q3 = gpt3["Salary"].quantile(0.75)
IQR = Q3-Q1
alt_sinir = Q1-1.5*IQR
ust_sinir = Q3+1.5*IQR
gpt3[(gpt3["Salary"]<alt_sinir)|(gpt3["Salary"]>ust_sinir)]

Empty DataFrame
Columns: [ID, Name, Department, Experience, Education, Salary, PerformanceScore, ProjectsCompleted, Remote, WorkingHours, Bonus, Age, Normalize]
Index: []

In [27]:
gpt3["Ratio"] = gpt3["ProjectsCompleted"] / gpt3["Experience"]
gpt3.loc[gpt3["Experience"]>=10].sort_values("Ratio",ascending=False).head(10)

,ID,Name,Department,Experience,Education,Salary,PerformanceScore,ProjectsCompleted,Remote,WorkingHours,Bonus,Age,Normalize,Ratio
288,289,Employee_289,Finance,10,Master,3293.0,1.50,26,False,45,50000.0,54,-0.1250,2.600000
30,31,Employee_31,Finance,11,High School,9739.0,1.82,28,False,58,8953.0,57,-0.2050,2.545455
223,224,Employee_224,IT,11,Bachelor,12661.0,3.68,28,True,36,9343.0,42,-0.6700,2.545455
280,281,Employee_281,Marketing,11,High School,16882.0,4.41,27,True,59,6779.0,22,-0.8525,2.454545
268,269,Employee_269,Operations,12,High School,19834.0,1.15,28,False,32,1876.0,20,-0.0375,2.333333
109,110,Employee_110,Finance,10,Master,15513.0,3.53,23,True,61,3792.0,43,-0.6325,2.300000
36,37,Employee_37,Operations,13,High School,12676.0,4.69,29,False,52,4607.0,48,-0.9225,2.230769
134,135,Employee_135,IT,11,High School,12767.0,1.73,24,True,44,6856.0,23,-0.1825,2.181818
297,298,Employee_298,Marketing,11,PhD,3314.0,4.96,23,False,32,9614.0,28,-0.9900,2.090909
299,300,Employee_300,Finance,12,High School,13041.0,1.26,25,False,59,5632.0,43,-0.0650,2.083333

In [131]:
gpt3["Bonus_norm"] = gpt3.groupby("Education")["Bonus"].transform(
    lambda x: (x - x.min()) / (x.max() - x.min())
)
gpt3.groupby("Department")["Bonus_norm"].mean().sort_values(ascending=False).head(2)

Department
Sales      0.488781
Finance    0.475202
Name: Bonus_norm, dtype: float64

In [115]:
gpt3["Agegrup"]=pd.cut(
    gpt3["Age"],
    bins=[0,29,40,50,float("inf")],
    labels=["Genc","Orta","Ortayasli","Yasli"]
)
gpt3.groupby("Agegrup",as_index=False).agg({
    "Salary":"mean",
    "PerformanceScore":"mean"
})

C:\Users\kerem\AppData\Local\Temp\ipykernel_65088\4166308973.py:6: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  gpt3.groupby("Agegrup",as_index=False).agg({

     Agegrup        Salary  PerformanceScore
0       Genc  11111.400000          3.273590
1       Orta  11674.000000          2.938118
2  Ortayasli  11118.042254          2.874384
3      Yasli  11098.721311          3.136719

In [150]:
import numpy as np
import pandas as pd

In [265]:
gpt3["Isegirisyili"]=pd.to_datetime(
    np.random.choice(pd.date_range("01-01-2015","01-01-2025"),size=(len(gpt3))),format="%d-%m-%Y"
)
gpt3["Year"]=gpt3["Isegirisyili"].dt.year
pd.pivot_table(gpt3,index="Department",columns="Year",aggfunc="size")

Year        2015  2016  2017  2018  2019  2020  2021  2022  2023  2024
Department
Finance        8     5     4     2     2     5     4     6     8     8
HR             2     6     5     4     4     3     5     2     9     2
IT             6     3     5     7     3     5     6     9     7     6
Marketing      5     8     5    10     5     7     8     4     6     6
Operations     3     3     4     5     4     4     5     9     6     3
Sales          4     3     6     3     1     2     6     6     5     3

In [273]:
pd.pivot_table(gpt3,index="Department",columns="Year",values=["Salary","PerformanceScore"],aggfunc="mean")

           PerformanceScore                                                                                               Salary                                                                                  \
Year                   2015      2016      2017      2018    2019      2020     2021      2022      2023      2024          2015          2016          2017          2018      2019          2020          2021
Department
Finance            3.313750  2.068000  2.717500  3.030000  2.7200  2.990000  2.72750  3.840000  2.702500  2.373750   8742.500000   8676.400000   7650.666667  14149.000000  13718.50  10492.000000  10369.000000
HR                 3.235000  3.155000  2.300000  3.272500  3.0675  3.106667  3.13600  3.540000  3.001111  2.385000  10783.500000   9220.000000  11545.400000   9175.750000  13722.25  16665.666667  10864.600000
IT                 2.938333  2.830000  2.616000  2.541429  4.0700  3.610000  3.22500  3.451111  3.084286  2.931667   9058.200000  16682.666667  13313.600000   8908.285714  14769.50  13223.333333  12976.666667
Marketing          3.272000  3.278750  3.480000  3.254000  2.4440  2.862857  2.83875  3.590000  2.418333  2.806667  13734.600000  10888.500000   7907.000000  13460.200000  12772.20  14412.142857   9918.375000
Operations         3.916667  1.913333  4.072500  2.734000  2.7300  3.470000  4.09600  3.251111  3.563333  2.893333   6556.666667   9630.333333  12181.333333  15550.600000  13286.50  12831.750000  12052.750000
Sales              2.937500  3.153333  2.861667  2.803333  1.9400  2.805000  2.71000  3.251667  3.436000  3.806667  11563.000000  12052.333333  10465.333333   8267.000000   8497.00  15908.500000  11058.166667


Year                2022          2023          2024
Department
Finance     13425.333333  10302.125000  11402.000000
HR           7082.500000  13046.555556   9005.500000
IT           9619.222222   9191.714286   9295.666667
Marketing   11510.750000   8001.166667  13608.000000
Operations   9920.444444  10395.600000  13641.333333
Sales       11116.400000  12442.800000  13363.666667

In [301]:
gpt3 = gpt3.sort_values(["Department", "Isegirisyili"])
gpt3["RollingSalary"] = gpt3.groupby("Department")["Salary"] \
                             .rolling(window=10, min_periods=1) \
                             .mean() \
                             .reset_index(level=0, drop=True)
pd.pivot_table(
    gpt3,
    index="Department",
    columns=gpt3["Isegirisyili"].dt.to_period("Y"),  # ay bazlı
    values="RollingSalary",
    aggfunc="first"  # zaten her hücrede 1 değer var
)

Isegirisyili     2015          2016          2017          2018          2019          2020          2021          2022          2023          2024
Department
Finance        9382.0   8819.777778   8073.500000   8736.555556  11026.666667   9649.222222  12461.200000  10944.900000  11667.400000   9887.400000
HR             4836.0   9185.666667  10442.333333  10919.700000  11419.000000  11649.600000  12691.400000  12802.200000  11023.400000  12381.900000
IT            11046.0  10289.500000  12271.777778  13455.700000   9043.000000  10963.222222  12595.428571  12900.111111   9908.800000   9807.900000
Marketing     13746.0  12788.833333  11035.200000  10093.400000  13102.200000  12269.800000  13779.700000  10987.800000   9827.000000   8777.900000
Operations     6664.0   6390.250000   8115.857143  10206.333333  13918.777778  14892.300000  13720.222222  13186.888889  10309.800000   9755.888889
Sales          7787.0  10491.500000  12804.000000  10229.500000   9609.000000   9641.600000   9498.200000  12441.700000  10875.111111  11889.444444

In [311]:
gpt3["Performance_norm"]=(gpt3["PerformanceScore"]-gpt3["PerformanceScore"].min()) / (gpt3["PerformanceScore"].min()-gpt3["PerformanceScore"].max())
gpt3["Projects_norm"]=(gpt3["ProjectsCompleted"]-gpt3["ProjectsCompleted"].min()) / (gpt3["ProjectsCompleted"].min()-gpt3["ProjectsCompleted"].max())
gpt3["Performans_skor"]=gpt3["Performance_norm"]*0.6 + gpt3["Projects_norm"]*0.4
gpt3.groupby("Department",as_index=False)["Performans_skor"].mean()

   Department  Performans_skor
0     Finance        -0.487517
1          HR        -0.524074
2          IT        -0.494437
3   Marketing        -0.509732
4  Operations        -0.561707
5       Sales        -0.498973

In [341]:
pt= pd.pivot_table(
    gpt3,
    index=["Department","Education"],
    columns="Remote",
    values=["Salary","Bonus"],
    aggfunc="mean",
    sort="Bonus"
)
pt.sort_values([("Bonus",True),("Bonus",False)],ascending=False)

                              Salary                       Bonus
Remote                         False         True          False        True
Department Education
Sales      PhD          12282.000000   9968.333333   2316.000000  8111.000000
IT         Master       11194.785714  12978.000000   5715.066667  7601.000000
Sales      Master        9497.571429  10422.333333   5123.857143  7336.333333
           High School  10979.571429  14531.444444   5218.142857  7162.444444
           Bachelor      9999.666667  11043.666667   7455.666667  7149.333333
Marketing  Master       11640.250000  10418.750000   4888.750000  6863.500000
HR         Bachelor     12943.333333   8424.000000   4418.000000  6478.333333
IT         High School   9562.714286   8463.100000   5565.571429  6340.000000
Finance    PhD          10381.000000  11613.375000   5326.500000  6044.750000
HR         PhD          10062.500000  11919.571429   5482.000000  5944.400000
Marketing  High School  13243.000000  10828.416667   7364.142857  5908.250000
Operations PhD          16517.750000   8972.714286   6733.500000  5839.142857
           Master       10213.750000  12584.500000   5007.500000  5615.400000
Marketing  PhD          10420.000000  13387.571429   5541.909091  5480.857143
Finance    Bachelor     10561.000000  16597.000000   5306.583333  5387.000000
HR         Master       12948.400000  12171.500000   8300.400000  5343.000000
IT         Bachelor     11883.000000  16052.600000   7514.250000  5186.800000
Operations Bachelor     10412.500000   8549.000000   5513.636364  4816.333333
Finance    Master        6560.500000   9233.800000  14974.500000  4490.200000
Marketing  Bachelor      9575.000000  13646.555556   5249.000000  4177.333333
Operations High School  11415.625000  18852.666667   4557.625000  4062.000000
Finance    High School   9989.000000   9947.333333   7360.571429  3834.166667
IT         PhD          12669.714286   8691.333333   6896.000000  3811.166667
HR         High School  11176.454545  11192.600000   3902.363636  2887.250000

In [349]:
gpt3.groupby("Department")["ProjectsCompleted"].cumsum()

127      5
11      29
188     45
106     57
8       66
      ...
1      485
9      495
221    508
282    532
147    544
Name: ProjectsCompleted, Length: 300, dtype: int64

In [351]:
gpt3

,ID,Name,Department,Experience,Education,Salary,PerformanceScore,ProjectsCompleted,Remote,WorkingHours,...,Ratio,Bonus_norm,Agegrup,Isegirisyili,Year,RollingSalary,Performance_norm,Projects_norm,Performans_skor,cumproje
127,128,Employee_128,Finance,12,High School,9382.0,1.88,5,False,58,...,0.416667,0.828967,Orta,2015-02-10,2015,9382.000000,-0.2200,-0.172414,-0.200966,5
11,12,Employee_12,Finance,2,PhD,15263.0,3.61,24,False,43,...,12.000000,0.771149,Orta,2015-03-26,2015,12322.500000,-0.6525,-0.827586,-0.722534,29
188,189,Employee_189,Finance,18,PhD,16203.0,4.39,16,True,38,...,0.888889,1.000000,Orta,2015-03-27,2015,13616.000000,-0.8475,-0.551724,-0.729190,45
106,107,Employee_107,Finance,7,High School,2802.0,2.63,12,True,58,...,1.714286,0.133050,Genc,2015-04-29,2015,10912.500000,-0.4075,-0.413793,-0.410017,57
8,9,Employee_9,Finance,17,Master,2904.0,4.68,9,True,44,...,0.529412,0.002668,Yasli,2015-05-16,2015,9310.800000,-0.9200,-0.310345,-0.676138,66
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1,2,Employee_2,Sales,29,Master,9470.0,4.65,19,False,49,...,0.655172,0.150150,Yasli,2023-08-05,2023,11902.333333,-0.9125,-0.655172,-0.809569,485
9,10,Employee_10,Sales,1,High School,10675.0,4.16,10,False,35,...,10.000000,0.422833,Orta,2023-10-07,2023,11115.777778,-0.7900,-0.344828,-0.611931,495
221,222,Employee_222,Sales,22,High School,14719.0,3.77,13,False,64,...,0.590909,0.221895,Genc,2024-04-12,2024,11889.444444,-0.6925,-0.448276,-0.594810,508
282,283,Employee_283,Sales,2,High School,6256.0,3.36,24,True,51,...,12.000000,0.784763,Genc,2024-04-29,2024,11326.100000,-0.5900,-0.827586,-0.685034,532
147,148,Employee_148,Sales,28,High School,19116.0,4.29,12,True,33,...,0.428571,0.624754,Orta,2024-10-17,2024,12283.400000,-0.8225,-0.413793,-0.659017,544

In [391]:
min_salary=gpt3["Salary"].min()
max_salary=gpt3["Salary"].max()
gpt3["salary_norm"]=gpt3["Salary"].apply(lambda x: (x-min_salary) / (max_salary-min_salary))
min_bonus=gpt3["Bonus"].min()
max_bonus=gpt3["Bonus"].max()
gpt3["bonus_norm"]=gpt3["Bonus"].apply(lambda x: (x-min_bonus) / (max_bonus-min_bonus))
gpt3["Toplam"]=gpt3["salary_norm"]+gpt3["bonus_norm"]
gpt3.sort_values("Toplam",ascending=False).head(5)

,ID,Name,Department,Experience,Education,Salary,PerformanceScore,ProjectsCompleted,Remote,WorkingHours,...,Isegirisyili,Year,RollingSalary,Performance_norm,Projects_norm,Performans_skor,cumproje,salary_norm,bonus_norm,Toplam
94,95,Employee_95,Marketing,13,PhD,19407.0,2.36,12,True,30,...,2020-06-13,2020,13505.6,-0.3400,-0.413793,-0.369517,575,0.968840,0.174440,1.143280
73,74,Employee_74,Marketing,23,High School,19644.0,3.14,23,True,38,...,2024-05-05,2024,9559.2,-0.5350,-0.793103,-0.638241,939,0.982516,0.144754,1.127270
32,33,Employee_33,Marketing,18,High School,19133.0,3.41,9,False,60,...,2018-02-13,2018,10914.0,-0.6025,-0.310345,-0.485638,308,0.953029,0.173410,1.126439
193,194,Employee_194,Sales,4,High School,19108.0,2.38,25,True,53,...,2020-02-02,2020,9641.6,-0.3450,-0.862069,-0.551828,224,0.951587,0.173450,1.125037
115,116,Employee_116,HR,22,Master,19248.0,3.82,26,False,37,...,2020-06-11,2020,12782.9,-0.7050,-0.896552,-0.781621,365,0.959665,0.158718,1.118383